fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <attributes>
    <name>Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/Forms/АнализГрафика/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АдресВХ") Тогда
		АдресХранилища = Параметры.АдресВХ;
		Если ЭтоАдресВременногоХранилища(АдресХранилища) Тогда
			СтруктураПараметров = ПолучитьИзВременногоХранилища(АдресХранилища);
			ЗаполнитьДиаграмму(СтруктураПараметров, Диаграмма);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьДиаграмму(СтруктураПараметров, Диаграмма)
	
	Диаграмма.Обновление = Ложь;
	Диаграмма.Очистить();

	Диаграмма.АвтоОпределениеПолногоИнтервала = Ложь;
	Диаграмма.УстановитьПолныйИнтервал(НачалоГода(Дата(СтруктураПараметров.Год, 1, 1)), КонецГода(Дата(
		СтруктураПараметров.Год, 1, 1)));

	Серия = Диаграмма.УстановитьСерию("Отпуска сотрудников");
	Для Каждого ОтпускСотрудника Из СтруктураПараметров.ОтпускаСотрудников Цикл
		Точка = Диаграмма.УстановитьТочку(ОтпускСотрудника.Сотрудник);
		Значение = Диаграмма.ПолучитьЗначение(Точка, Серия);
		Интервал = Значение.Добавить();
		Интервал.Начало = ОтпускСотрудника.ДатаНачала;
		Интервал.Конец = ОтпускСотрудника.ДатаОкончания;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
